date()
تُستخدم لعرض التاريخ أو الوقت بصيغة معينة.
<?php
echo "<pre>";
echo date("Y-m-d H:i:s"); // 2025-12-19 23:35:00
echo "<pre>";
echo "------------------------";
?>


*أشهر التنسيقات:*
- `Y` → السنة (2025)
- `m` → الشهر (01 إلى 12)
- `d` → اليوم (01 إلى 31)
- `H` → الساعة بصيغة 24 (00 إلى 23)
- `i` → الدقائق
- `s` → الثواني
------------------------


 time()
ترجع عدد الثواني منذ 1 يناير 1970 (Unix Timestamp).

<?php

echo time(); // مثال: 1766181300
echo "<pre>";
echo "------------------------";
?>



 mktime()
تُستخدم لإنشاء طابع زمني (timestamp) من تاريخ ووقت معين.
<?php
$timestamp = mktime(15, 30, 0, 12, 25, 2025);
echo date("Y-m-d H:i:s", $timestamp); // 2025-12-25 15:30:00
echo "<pre>";
echo "------------------------";
?>


 strtotime()
تحوّل سلسلة نصية إلى طابع زمني.
<?php
$ts = strtotime("next Friday");
echo date("Y-m-d", $ts); // تاريخ الجمعة القادمة
echo "<pre>";
echo "------------------------";
?>




 getdate()
ترجع مصفوفة تحتوي على معلومات مفصلة عن التاريخ والوقت الحالي.
<?php
print_r(getdate());
echo "<pre>";
echo "------------------------";
?>




 date_diff() و date_create()
لحساب الفرق بين تاريخين.
<?php
$date1 = date_create("2025-12-01");
$date2 = date_create("2025-12-19");
$diff = date_diff($date1, $date2);
echo $diff->format("%a أيام"); // 18 أيام
echo "<pre>";
echo "------------------------";
?>




 sleep() و usleep()
لتأخير تنفيذ السكربت.
<?php
sleep(3); // تأخير 3 ثواني
usleep(500000); // تأخير نصف ثانية (500,000 ميكروثانية)
echo "<pre>";
echo "------------------------";
?>